package commands

import (
	"fmt"
	tgbotapi "github.com/OvyFlash/telegram-bot-api"
	"go.uber.org/zap"
)

func (c *Commander) OperatingMode(message *tgbotapi.Message) {
	msg := tgbotapi.NewMessage(message.Chat.ID, fmt.Sprintf(
		"⚙️ <strong>Режимы работы</strong> ⚙️\n\n"+
			"🏙 <i>Город</i> 🏙\n\n"+
			"Режим работы, в котором бот отслеживает и отправляет оповещения от датчиков по <strong>всему городу</strong>. Данный функционал следует использовать, если вы хотите следить за общим состоянием воздуха в городе 🍃\n\n\n"+
			"🏘 <i>Район</i> 🏘\n\n"+
			"Режим работы, в котором бот отслеживает и отправляет оповещения от датчиков по <strong>выбранному району</strong> Кемерово. Данный функционал следует использовать, если вы хотите следить за конекретным районом/районами города 🍃\n\n\n"+
			"🏡 <i>Дом</i> 🏡\n\n"+
			"Режим работы, в котором бот отслеживает и отправляет оповещения от датчиков <strong>в пределах километра от выбранного места на карте</strong>. Данный функционал следует использовать, если вы хотите следить за ближайшими от интересующего места датчиками 🍃\n\n\n"+
			"🔎 <i>Кастомный</i> 🔎\n\n"+
			"Режим работы, в котором бот отслеживает и отправляет оповещения от <strong>выбранных вами датчиков</strong>. Данный функционал слудет использовать, если вы хотите выбрать датчики самостоятельно, за которыми хотите наблюдать 🍃\n\n",
	),
	)
	err := c.Send(SendPayload{Msg: msg})

	if err != nil {
		zap.L().Error("Error sending operating_mode message", zap.Error(err))
	}
}
